; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	image1 - mode
	infrared0 - mode
	image2 - mode
	Star1 - direction
	Star2 - direction
	Star6 - direction
	GroundStation5 - direction
	GroundStation4 - direction
	GroundStation3 - direction
	GroundStation0 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Planet9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Planet13 - direction
	Planet14 - direction
	Planet15 - direction
)
(:init
	(supports instrument0 infrared0)
	(calibration_target instrument0 Star6)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation5)
	(supports instrument1 image1)
	(supports instrument1 image2)
	(supports instrument1 infrared0)
	(calibration_target instrument1 GroundStation5)
	(calibration_target instrument1 GroundStation3)
	(supports instrument2 image2)
	(calibration_target instrument2 GroundStation0)
	(calibration_target instrument2 GroundStation4)
	(supports instrument3 image1)
	(supports instrument3 infrared0)
	(calibration_target instrument3 GroundStation0)
	(calibration_target instrument3 GroundStation3)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet9)
)
(:goal (and
	(pointing satellite0 GroundStation4)
	(have_image Phenomenon7 image2)
	(have_image Planet8 image2)
	(have_image Planet9 image2)
	(have_image Planet10 image2)
	(have_image Phenomenon11 image1)
	(have_image Phenomenon12 image1)
	(have_image Planet13 infrared0)
	(have_image Planet14 image1)
	(have_image Planet15 image1)
))

)

; plan
1. (turn_to satellite1 groundstation3 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 groundstation3)
   goals met: 0 of 10
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 10
3. (calibrate satellite1 instrument1 groundstation3)
   added: (calibrated instrument1)
   goals met: 0 of 10
4. (turn_to satellite1 phenomenon7 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 phenomenon7)
   goals met: 0 of 10
5. (take_image satellite1 phenomenon7 instrument1 image2)
   added: (have_image phenomenon7 image2)
   goals met: 1 of 10
6. (turn_to satellite1 phenomenon12 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 phenomenon12)
   goals met: 1 of 10
7. (take_image satellite1 phenomenon12 instrument1 image1)
   added: (have_image phenomenon12 image1)
   goals met: 2 of 10
8. (turn_to satellite1 phenomenon11 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 phenomenon11)
   goals met: 2 of 10
9. (take_image satellite1 phenomenon11 instrument1 image1)
   added: (have_image phenomenon11 image1)
   goals met: 3 of 10
10. (turn_to satellite0 groundstation4 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 groundstation4)
   goals met: 4 of 10
11. (turn_to satellite1 planet10 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 planet10)
   goals met: 4 of 10
12. (take_image satellite1 planet10 instrument1 image2)
   added: (have_image planet10 image2)
   goals met: 5 of 10
13. (turn_to satellite1 planet13 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 planet13)
   goals met: 5 of 10
14. (take_image satellite1 planet13 instrument1 infrared0)
   added: (have_image planet13 infrared0)
   goals met: 6 of 10
15. (turn_to satellite1 planet14 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 planet14)
   goals met: 6 of 10
16. (take_image satellite1 planet14 instrument1 image1)
   added: (have_image planet14 image1)
   goals met: 7 of 10
17. (turn_to satellite1 planet15 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 planet15)
   goals met: 7 of 10
18. (take_image satellite1 planet15 instrument1 image1)
   added: (have_image planet15 image1)
   goals met: 8 of 10
19. (turn_to satellite1 planet8 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 planet8)
   goals met: 8 of 10
20. (take_image satellite1 planet8 instrument1 image2)
   added: (have_image planet8 image2)
   goals met: 9 of 10
21. (turn_to satellite1 planet9 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 planet9)
   goals met: 9 of 10
22. (take_image satellite1 planet9 instrument1 image2)
   added: (have_image planet9 image2)
   goals met: 10 of 10
